import requests
import sys
import re
import prettytable as pt
import datetime
import urllib.parse
from bs4 import BeautifulSoup


# 牛散列表

def get_html(url):
    headers = {"User-Agent":"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36"}
    reponse=requests.get(url,headers=headers)
    #print (reponse.text)
    reponse.encoding = 'utf-8'
    soup=BeautifulSoup(reponse.text,'html.parser')

    print (soup.title.string)
    item=soup.find_all('li')
    return item


def get_data(url):
    new_item=get_html(url)
    nslist=[]
    # print (new_item)

    for item in new_item:
        ns=item.find('a').get_text().strip()
        nslist.append(ns)

    return nslist


def get_list():
    list=['李强', '股东人数', '张长虹', '余笃定', '新加坡政府投资有限公司(gic private limited)', '肖行昌', '何怡', '赵吉庆', '周建',
          '蔡晓东', '龙虎榜', '张海', '陈玉忠', '熊基凯', '杨飞', '王立群', '苑临轩', '张继红', '王宇豪', '杨桦', '王新', '金雷',
          '黄超', '牛桂兰', '张振秋', '翟晓波', '李彤', '王玉年', '邹瀚枢', '胡敏', '王凯', '邓歌伦', '王勇', '黄辉', '张伟',
          '罗军', '朱斌', '张寿清', '张晓夏', '高瓴资本管理有限公司-hcm中国基金hillhouse capital management pte ltd', '林渐娟',
          '近端次新股', '郑素娥', '袁琴美', '王华锋', '吕良丰', '陈健', '周峰', '陈庆华', '石定钢', '李力', '高仕军', '蒋仕波',
          '翁天波', '陈丽娟', '张跃军', '金燕', '彭伟', '张扬', '王建飞', '王成华', '王翔宇', '刘静', '刘辉', '王士龙', '张强',
          '徐善水', '王庆新', '王伟', '李欣', '石庭波', '许磊', '阮海良', '施建刚', '胡亦对', '王淑霞', '刘文华', '金兴旺',
          '陈晓红', '王萍', '何雪萍', '葛贵兰', '张源', '李玲', '李俊', '王栋', '张林', '王凤飞', '李卓', '张鹏', '王秀英',
          '徐永才', '张海峰', '王连永', '万忠波', '黄佩玲', '董蓉', '钱光海', '何志坚', '周仁瑀', '谢文贤', '吴东魁',
          '陈克春', '刘丽', '陈丽君', '沈怀灵', '黄平', '王玥', '丑建忠', '周建林', '李明', '胡浩峰', '刘月明', '张韬',
          '方士雄', '葛藤蔓', '杨阳', '陈平', '王辉', '谢香镇', '郑珍', '王景峰', '程书广', '王坚宏', '李明军', '张捍华',
          '王建华', '郑文宝', '刘伟', '梁伟', '杨林', '胡祖平', '徐开东', '唐武盛', '徐留胜', '寿稚岗', '俞雄伟', '伍文彬',
          '张宏', '安伟', '上海明汯投资管理有限公司-明汯价值成长1期私募投资基金', '胡雪坤', '李天虹', '吴春燕', '李建华',
          '俞丽', '吴银河', '董敏', '刘岩', '李兴华', '潘宇红', '单美琴', '冯量', '刘波', '高军', '黄春芳', '于建军',
          '陈能依', '孙月娥', '赖汉宣', '阎志', '林泽华', '王涛', '谢慧明', '冯翔', '单建明', '张素芬', '郭永涛', '胡勃',
          '李斌', '周杰', '郑伟', '李冬菊', '张勇', '罗瑞云', '陈涛', '李红', '雷立军', '刘长羽', '贝国浩', '杨英',
          '杨成社', '林曙阳', '李晶', '张天虚', '韩涛', '张婷', '滕用庄', '张剑', '刘勇', '杨钧', '杨雪梅', '陈根财',
          '陈建', '张玉萍', '刘芳', '廖伟俭', '王斌', '姚建华', '汪海敏', '杨燕灵', '陈小毛', '牛散', '李明彪', '陈雅萍',
          '雷刚', '尹俊涛', '叶冠军', '侯秀兰', '王彬', '沈向红', '钱军', '易武', '张宇', '常鑫民', '阮寿国', '王敏',
          '马信琪', '李红卫', '李葛卫', '王春飞', '方奕忠', '刘益谦', '陈保华', '张浩', '谢仁国', '袁永刚', '张青', '周军',
          '王静', '戴文萍', '黄永耀', '吴军', '徐功荣', '李涛', '吴安', '王忠友', '尤颖', '邱松', '赵剑', '罗明光', '丁聪聪',
          '王孝安', '李霞', '周奇平', '梁盛谊', '柴长茂', '程鹏', '涨停板', '周信钢', '孙伟', '王光坤', '陈钢', '方威', '毕树真',
          '孙慧明', '赵建平', '张海涛', '陈超', '蓝歆旻', '宋建波', '沈振兴', '李胜军', '刘琼', '刘霞', '王庆华', '章志坚',
          '章建平', '吕剑锋', '刘莹', '毛勇', '李栋', '李凤燕', '张秀', '杨蕾', '季爱琴', '张涛', '胡玉兰', '魏巍', '张明',
          '黄杰', '王进南', '杨捷', '阮彩友', '王贵生', '许尚龙', '赵吉', '赵东岭', '邬凌云', '李虹', '陈志勇', '陈乙超', '李勇',
          '熊玲瑶', '黄松浪', '王荣', '李琳', '彭凯', '王爱华', '李丽', '徐小蓉', '李敏', '冯译嶙', '张武', '孟星', '金国新',
          '陈峰', '林强', '边海燕', '吴志祥', '张玲', '葛品利', '陈佳琪', '王建国', '朱伟', '王素勤', '余欢', '王维', '徐东福',
          '俞雄华', '施玉庆', '彭伟燕', '李华', '徐鹏', '毛向阳', '谭振华', '程燕', '钟仁美', '朱祥', '王艳', '葛卫东', '刘锋',
          '徐进', '吴键', '费占军', '杨子江', '郭晓民', '香港中央结算有限公司', '陈华明', '麦淑青', '陈军', '杜辉雯', '北向资金',
          '李杰', '刘健', '王秀荣', '王钧', '吴峰', 'ubs ag瑞士联合银行集团', '韩军', '李淑华', '李莉', '杨健', '杨华', '吴志刚',
          '王海波', '陈方方', '张建国', '陈敏', '方怀月', '王丹', '杨三彩', '胡坤群', '王冬梅', '杨波', '陈晓华', '鲁晏余',
          'jpmorgan chase bank national association摩根大通银行', '郭海清', '陈武峰', '林荣', '姜东林', '李利伟', '李平', '刘昕',
          '罗予频', '上海高毅资产管理合伙企业(有限合伙)-高毅邻山1号远望基金', '王卫列', '朱峥', '马骉', '何文钜', '李江', '杨伟', '杨廷栋',
          '刘少鸾', '杨春', '李洁', '陈静', '杨力', '王小平', '黄友平', '李松强', '谢征昊', '周岭松', '孙娜', '王毅','李凤英', '王建军',
          '朱雪松', '程鑫', '刘丹', '张良', '周建国', '刘磊', '陈峥', '王国庆', '黄鑫', '杨琪', '陈勇', '张磊', '王贺军', '吴卫红',
          '张沐城', '王建忠', '朱六平', '张健', '皮敏蓉', '陈正忠', '黄社兰', '张敏', '王春', '冯军', '金志峰', '李伟', '陈海华',
          '杨帆', '王博渊', '陈萍', '杨雅婷', '张建军', '首页', '刘晓东', '邓克维', '周爽', '张红', '曲春林', '袁仁泉', '陈慧', '刘世强',
          '王娟', '李威', '王志明', '王健', '王燕', '刘强', '童萍', '吕强', '钱海平', '王君', '代德明', '付小铜', '吴景珍', '陈武',
          '莫景献', '王刚', '江伟朋', '陈建新', '吴昊', '杨祖贵', '肖裕福', '周建禄', '陈世辉', '张营', '宋伟铭', '高雅萍', '张杰',
          '洪军', '徐正', '熊劭春', '王磊', '张亮', '黎虹', '顾萍', '李晨', '杨光', '雷显炳', '杨奇', '顾人祖', '梁军', '陈强',
          'hkscc nominees limited香港中央结算(代理人)有限公司', '孟庆亮', '陈发树', '张丽萍', '吴培伟', '姜雪', '杨建新', '施侃',
          '吴培侠', '王强', '廖晔', '洪泽君', '吴海燕', '刘超', '高勇', '巩和国', '吴浩源', '郭健', '胡晓', '刘洁', '张虹', '彭崇勃',
          '魏玉芳', '刘涛', '杨文江', '应一城', '何炜', '李春生', '赵睿', '周宇光', '张超', '毛韦明', '李琦森', '夏重阳', '李军', '林奇',
          '杨建伟', '王威', '基本养老保险基金一二零四组合', '王鹏飞', '郭劲松', '顾梦骏', '袁芳', '张静', '周晨', '胡雪龙', '冯美娟',
          '顾青', '章安', '马国斌', '王齐玉', '刘丽萍', '王文霞', '黄腾宇', '俞文灿', '蒋根青', '刘建军', '姜兆君', '王正', '关海果',
          '林燕', '盛济良', '张晶', '李萍', '许晓娟', '刘峰', '陈曦', '刘丽丽', '黄晓霞', '吴建新', '刘平', '张维仰', '昝圣达', '李建民',
          '刘志强', '傅频青', '林园', '蔡莉萍', '郑秋红', '袁河']


if __name__=="__main__":
    url = "http://www.tetegu.com/niusan/"
    nslist=get_data(url)
    print (set(nslist))